Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: དཀོན་མཆོག་འབྱུང་གནས་ཞེས་བྱ་བའི་བསྐལ་པ་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་དྲི་མ་མེད་ཅེས་བྱ་བར་ཡོན་ཏན་གྱི་རྒྱལ་པོར་སྣང་བ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བ། ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །
en: during the eon called Ratnākara, in the universe called Candravimalā. He will appear in the world as the Thus-Gone One, the worthy one, the perfect Buddha called Guṇarāja­prabhāsa. He will be learned and virtuous, a blissful one, a knower of the world, a charioteer who guides beings, an unsurpassed being, a teacher of gods and humans, and a blessed buddha.

source: ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་དྲི་མ་མེད་པ་དེ་ནི་ལག་མཐིལ་ལྟར་མཉམ་པར་འགྱུར་ཏེ། (བཻདཱུརྱ་,བཻ་ཌཱུརྱ་)དཀར་པོ་ལས་གྲུབ་པ། ཟླ་བ་ལྟ་བུར་སྣང་བ། ཤིན་ཏུ་དྲི་མ་མེད་པ། ཤིན་ཏུ་རྣམ་པར་དག་པ། མཆིང་བུ་མེད་པའོ། །
en: Ānanda, that universe called Candravimalā will be smooth like the palm of the hand and made of white beryl. It will shine like the moon and be stainless, immaculate, and devoid of any discoloration.

source: དེ་བཞིན་གཤེགས་པ་དེའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཡང་ཚད་མེད་པར་གྱུར་ཏེ།
en: This thus-gone one’s saṅgha of bodhisattvas will be immeasurable, and

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པ། རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་པ་ཤ་སྟག་གོ། །
en: all those bodhisattva great beings will without exception have reached the state of irreversibility and the inconceivable level of liberation.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་ནམ་མཁའ་ལ་ཁང་པ་བརྩེགས་པ་ན་ལོངས་སྤྱོད་དེ།
en: Those bodhisattvas will enjoy floating mansions in the sky, and

source: དེ་དག་ནམ་མཁའ་ལ་ཁང་པ་བརྩེགས་པ་ན་གནས་པ་ན་(བཻདཱུརྱ་,བཻ་ཌཱུརྱ་)དཀར་པོ་ལས་གྲུབ་པའི་ས་ཆེན་པོ་དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གྱི་རྒྱལ་པོར་སྣང་བ་དེའི་གཟུགས་བརྙན་མཐོང་བར་འགྱུར་རོ། །
en: while residing there they will be able to see the image of the Blessed One, the Thus-Gone One Guṇarāja­prabhāsa reflected in the ground made of white beryl.

source: དེ་དག་གིས་མཐོང་མ་ཐག་ཏུ་ཆོས་འདི་དག་ཐམས་ཅད་ནི་གཟུགས་བརྙན་ལྟ་བུའོ་ཞེས་དྲན་པ་སྐྱེ་བར་འགྱུར་རོ། །
en: As soon as they see his image, they will remember that all phenomena are similar to reflections, and

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་གང་ལ་ཐེ་ཙོམ་ཟ་བ་ན་དེ་དེ་བཞིན་གཤེགས་པས་དེ་ལ་སྣང་བར་གྱུར་པ་དེ་ལ་ཞུ་བར་འགྱུར་རོ། །
en: whenever doubts about the Dharma arise in their minds, they will pose questions to that reflection of the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཞུས་པའི་ལུང་བསྟན་པས་སེམས་རངས་པར་མཛད་པར་འགྱུར་རོ། །
en: Their questions will then be answered by that thus-gone one, thus satisfying their minds.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཆོས་དེ་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་རོ། །
en: Upon hearing the Dharma, those bodhisattvas will reach acceptance of the unborn nature of phenomena.

source: ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཡོད་པར་མི་འགྱུར་རོ། །
en: Ānanda, in that universe there will be no villages, cities, towns, provinces, countries, or royal palaces—

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ནམ་མཁའ་ལ་ཁང་པ་བརྩེགས་པ་ན་འཁོད་པར་འགྱུར་རོ། །
en: all beings will live in such mansions in the sky.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་བུད་མེད་དུ་གདགས་པའང་མེད་པར་འགྱུར་རོ། །
en: In that buddha realm, even the word woman will not be heard—

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་པད་མའི་སྙིང་པོ་ལས་བརྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ། །
en: all beings will be born miraculously from the hearts of lotus flowers.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཁ་ཟས་སུ་གདགས་པ་མེད་དེ།
en: Even the word food will not be heard—

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་བསམ་གཏན་ལ་དགའ་བ་དང་། ཆོས་ལ་དགའ་བའི་ཟས་ཅན་དུ་འགྱུར་རོ། །
en: everyone will feed on the joys derived from concentration and the Dharma.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་གཞན་རྣམ་པར་གཞག་པ་མེད་དེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་ཐེག་པ་ཆེན་པོ་ལ་ངེས་པར་འགྱུར་བ་དག་གོ། །
en: Everyone will be firmly established within the Great Vehicle and nowhere else.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཚུལ་ཁྲིམས་ལོག་པར་ཞུགས་པའམ། ལྟ་བ་ལོག་པར་ཞུགས་པའམ། ཆོ་ག་ལོག་པར་ཞུགས་པའམ། འཚོ་བ་ལོག་པར་ཞུགས་པའི་སེམས་ཅན་འགའ་ཡང་མེད་པར་འགྱུར་རོ། །
en: No one will adhere to wrong discipline, wrong views, wrong behavior, or wrong livelihood.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་ནན་ཏན་དང་ལྡན་པ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་བརྩོན་འགྲུས་བརྩམས་པར་འགྱུར་བ་ཤ་སྟག་གོ། །
en: Everyone will be determined and strive for buddha qualities.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བདུད་དམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་འམ། གཞན་མུ་སྟེགས་ཅན་སྤྱོད་པ་ཅན་དང་། ཀུན་ཏུ་རྒྱུ་དང་དམིགས་པའི་ལྟ་བ་ལ་མངོན་པར་ཞེན་པ་དང་། ཕ་རོལ་རྒོལ་བ་མེད་པར་འགྱུར་རོ། །
en: In that buddha realm there will be no demons or gods of the demonic class, and there will be no non-Buddhist proponents such as carakas and parivrājakas, no one who clings to conceptual views, and no opposing factions.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་ཟབ་མོའི་སྤྱོད་ཡུལ་སྟོང་པ་ཉིད་ཀྱི་ཕྱག་རྒྱས་བཏབ་པར་འགྱུར་རོ། །
en: All beings will be marked by the seal of emptiness—the profound domain.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་མིང་དུ་བཏགས་པ་ཙམ་དང་། འདུ་ཤེས་ཙམ་མ་གཏོགས་པར་ལྷ་དང་མི་ཞེས་ཐ་དད་དུ་བྱ་བ་མེད་པར་འགྱུར་རོ། །
en: In that universe, with the exception of their mere names and titles, there will be no difference between gods and humans;

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་ཡོངས་སུ་སྤྱོད་པ་མཚུངས་པར་འགྱུར་རོ། །
en: everyone will share the same experience.

source: ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་ཡོན་ཏན་གྱི་རྒྱལ་པོར་སྣང་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ཡང་ལྷ་དང་། མི་རྣམས་ཀྱི་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་བར་གྱི་བསྐལ་པ་བཅུ་ཐམ་པར་བཞུགས་པར་འགྱུར་རོ། །
en: “Ānanda, the Blessed One, the thus-gone one, the worthy one, the perfect Buddha Guṇarāja­prabhāsa will remain for ten intermediate eons, to bring benefit and happiness to many gods and humans.

source: བཅོམ་ལྡན་འདས་ཡོན་ཏན་གྱི་རྒྱལ་པོར་སྣང་བ་དེ་བཞིན་གཤེགས་པ་དེ་གང་གི་ཚེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བཞེད་པ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་འབར་བ་འདི་ངའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ
en: When the Blessed one, the Thus-Gone One Guṇarāja­prabhāsa eventually decides to pass into nirvāṇa, he will prophesy, ‘After me, the bodhisattva great being Uttaptavīrya will awaken to unsurpassed and perfect buddhahood.

source: བཀོད་པ་ཆེན་པོ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་རོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་འབར་བ་ཞེས་བྱ་བ་ལུང་བསྟན་ནས་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: He will be a thus-gone one, a worthy one, a perfect buddha called Mahāvyūha. He will be learned and virtuous, a blissful one, a knower of the world, a charioteer who guides beings, an unsurpassed being, a teacher of gods and humans, and a blessed buddha.’ After making this prophecy about the bodhisattva Uttaptavīrya he will then pass into nirvāṇa.

source: ཀུན་དགའ་བོ་བར་གྱི་བསྐལ་པ་དེ་ཡང་སངས་རྒྱས་དཀོན་མཆོག་དང་ཆོས་དཀོན་མཆོག་དང་དགེ་འདུན་དཀོན་མཆོག་དང་མི་འབྲལ་བར་འགྱུར་ཏེ།
en: Ānanda, during these intermediate eons, beings will never be separated from the Buddha Jewel, the Dharma Jewel, and the Saṅgha Jewel;

source: བར་གྱི་བསྐལ་པ་དེ་ནི་དཀོན་མཆོག་འབྱུང་བ་ཞེས་བརྗོད་དོ། །
en: this intermediate eon will therefore be called Ratnasaṃpad.”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བཅོམ་ལྡན་འདས་ལས་ལུང་བསྟན་པ་ཐོས་ནས་དགའ་ཞིང་མགུ་སྟེ།
en: When the kiṃnara king Druma heard the prophecy of the Blessed One, he became satisfied, cheerful, thrilled, and elated.

source: ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་ནས། དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: With joy and happiness filling his mind,

source: བྱང་ཆུབ་སེམས་དཔའི་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བའི་ཤུགས་ཀྱིས་ས་ལས་སྟེང་གི་བར་སྣང་ལ་ཤིང་ཏ་ལ་བདུན་ཙམ་དུ་འཕགས་ཏེ།
en: through the force of this bodhisattva’s joy and delight, he rose up into the air to a height of seven palm trees.

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དད་པ་རྒྱ་ཆེར་སྤེལ་བ་དང་། དགེ་བའི་རྩ་བ་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་ཤེས་རབ་ཀྱི་སྤོབས་པས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: Then, in order to increase the faith of the entire retinue and to generate roots of virtue, he uttered these verses through the power of the Buddha and his own insightful eloquence:

source: ཆོས་འདི་ཐམས་ཅད་རབ་ཏུ་དབེན་པ་དང་། །དྲི་མ་མེད་དེ་ནམ་མཁའི་ངོ་བོ་ཉིད། །རྒྱུད་ཀྱི་དམ་པ་འདི་ནི་རྣམ་ཤེས་ན། །དེ་ཕྱིར་དེ་དག་ཐུབ་སྲས་ཐུ་བོར་འགྱུར། །
en: “All phenomena are void and stainless— They have the essential nature of space. Those who understand this sacred key point Will become the foremost children of the Sage.

source: རྨི་ལམ་བཞིན་དུ་མཐོང་བ་ཅུང་ཟད་མེད། །ཐམས་ཅད་མེད་དེ་གཟུང་མེད་གསོག་དང་གསོབ། །ཆོས་རྣམས་ཐམས་ཅད་རྨི་ལམ་འདྲར་ཤེས་ནས། །འདུས་བྱས་དག་ལ་སྐྱོ་བར་འགྱུར་བ་མེད། །
en: “Just like dreams, all phenomena are completely beyond perception— They are nonexistent, beyond apprehension, unreal, and empty. Those who know that all phenomena are like dreams Will not experience weariness in relation to conditioned things.

source: ལ་ལས་སྒྱུ་མའི་རྟ་དང་གླང་ཆེན་དང་། །ཤིང་རྟ་དཔུང་བུ་ཆུང་དང་བཞོན་མཐོང་བ། །དམ་པའི་དོན་དུ་སྙིང་པོ་མེད་པ་ལྟར། །ཕུང་པོ་འདི་དག་སྒྱུ་འདྲ་སྙིང་པོ་མེད། །
en: “The appearances of magically created Horses, elephants, chariots, soldiers, and mounts Are ultimately devoid of substance. In the same way, the aggregates are insubstantial, like illusions.

source: གཟུགས་ཀྱི་རང་བཞིན་དབུ་བ་རྡོས་པ་བཞིན། །ཚོར་བ་འདི་ནི་ཆུ་ཡི་ཆུ་བུར་འདྲ། །འདུ་ཤེས་དག་ནི་སྨིག་རྒྱུ་འདྲ་བར་གསུངས། །
en: “The Victor has said that forms have the nature of foam, Feelings are similar to water bubbles, Perceptions are like mirages, And

source: འདུས་བྱས་ཐམས་ཅད་ཆུ་ཤིང་སྙིང་པོ་མེད། །
en: formations are hollow, like plantain trees.

source: སྲིད་གསུམ་འདི་ནི་སེམས་ཡིད་རྣམ་པར་ཤེས། །རྒྱལ་བས་དེ་བཞིན་སྒྱུ་འདྲ་གསོག་ཏུ་གསུངས། །
en: “Likewise, he has said that the mental consciousness of the three realms Is unreal, like a magical illusion.

source: གཟུགས་ཀྱི་རང་བཞིན་སྟོང་པར་རིག་ནས་ནི། །འདུས་བྱས་དག་ལ་ནམ་ཡང་སྐྱོ་བ་མེད། །
en: Those who know that forms are intrinsically empty Will never experience weariness in relation to conditioned things.

source: ཁམས་བཞི་པོ་ནི་ཆོས་ཀྱི་དབྱིངས་འདྲ་དང་། །སྐྱེ་མཆེད་རྣམས་ནི་གྲོང་སྟོང་ལྟ་བུ་དང་། །ཆོས་འདི་གསོག་དང་གསོབ་ལྟར་རྣམ་ཤེས་པ། །དེ་དག་རྒྱལ་བའི་ཆོས་མཛོད་འཛིན་པ་ཡིན། །
en: “Those who know that the four elements are similar to the realm of phenomena, That the sense sources are like empty cities, And that phenomena are unreal and empty Are in possession of the Dharma treasure of the victorious ones.

source: རབ་ཏུ་དུལ་ཕྱིར་སྦྱིན་དང་དུལ་བ་དང་། །དེ་བཞིན་ཚུལ་ཁྲིམས་རྣམ་དག་ཚུལ་ཁྲིམས་དང་། །རྟག་ཏུ་འཕགས་པའི་ཚུལ་གྱིས་བཟོད་མི་ཟད། །སྟོང་པ་ཉིད་ཕྱིར་བརྩོན་འགྲུས་རྣམ་པར་དག །བསམ་གཏན་རང་བཞིན་འགྱུར་བ་མེད་པ་དང་། །དེ་ལྟར་ཤེས་རབ་ཆགས་མེད་མ་སྤྲོས་པར། །གང་གི་འཇུག་པ་དེ་འདྲར་གྱུར་པ་དེ། །ཕ་རོལ་ཕྱིན་པའི་ཕ་རོལ་རབ་ཏུ་ཕྱིན། །
en: “Those who, in order to completely tame themselves, Engage in generosity, self-control, discipline, and pure training, Those who always cultivate infinite patience with a noble attitude And pursue emptiness with flawless diligence, “Those who constantly remain in the state of concentration And develop insight free from attachment Without generating concepts— They will gain mastery over the perfections.

source: བདག་མེད་ཁོ་ན་ཉིད་ཕྱིར་བྱམས་པ་མཉམ། །ནམ་མཁའ་ལྟ་བུར་གོང་དུ་སྙིང་རྗེ་དག །ཞི་ཕྱིར་དགའ་དང་བཏང་སྙོམས་བཅས་པ་ཡི། །ལམ་འདི་ཚངས་པའི་ལམ་སྟེ་རྟག་ཏུ་ཞི། །
en: “Impartial love based on selflessness, Superior space-like compassion, And joy and equanimity derived from peace: That is the path of purity—it is always peaceful.

source: བསྡུ་བ་བཞི་པོ་ཁྱད་པར་འཕགས་པ་འདི། །རྣམ་པར་འདྲེན་པས་རྗེས་སུ་གཟུང་ཕྱིར་གསུངས། །
en: “The Guide has taught the extraordinary four means of attracting disciples In order to gain students.

source: འཛིན་པ་མེད་ཅིང་རྣམ་རྟོག་གང་མེད་པ། །དེ་ནི་བསྡུ་བའི་དངོས་པོའི་ཕ་རོལ་ཕྱིན། །
en: Those who are free from grasping and conceptualization Will perfect those means of attraction.

source: སེམས་ཅན་འདི་དག་བདག་མེད་སེམས་ཅན་མེད། །སྲོག་དང་གསོ་བ་གང་ཟག་མི་རྙེད་དོ། །
en: “Sentient beings are devoid of self, sentient being, Life principle, individuality, and person, And

source: དབང་པོ་དྲུག་འདི་སྟོང་སྟེ་རབ་ཞི་བར། །གང་ཤེས་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན། །
en: the six senses are empty and completely pacified; Those who understand this are bodhisattvas.

source: སེམས་ཅན་མེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་མེད། །
en: “Sentient beings and bodhisattvas are nonexistent.

source: དེ་ནི་གང་དུའང་བདག་མེད་རློམ་སེམས་མེད། །གཉིས་དང་བྲལ་ཞིང་མ་ཆགས་སྤྲོས་མེད་པ། །སེམས་ཅན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དཔལ་ལྡན། །
en: Sentient beings who understand that there is no self, And who are free from thinking, duality, attachment, And concepts, are glorious bodhisattvas.

source: ཆོས་འདི་སྙིང་པོ་མེད་དེ་སྒྱུ་མ་འདྲ། །གང་དུའང་མི་འོང་ནམ་ཡང་འགྲོར་མི་འགྱུར། །
en: “Like illusions, phenomena lack substance— They do not come from or go anywhere.

source: ཆོས་དབྱིངས་འདི་ཡི་གནས་པ་རིག་ནས་ནི། །རྒྱལ་བས་དེ་བཞིན་ཉིད་ནི་མཉམ་སངས་རྒྱས། །
en: The victorious ones see the mode of the realm of phenomena— They are buddhas who are identical to suchness.

source: གང་ནའང་ཡོད་པའམ་མེད་པ་མེད་མོད་ཀྱི། །རྒྱུ་ལ་བརྟེན་ནས་ཆོས་རྣམས་འབྱུང་བས་ན། །མཁའ་ལ་གློག་མཐོང་འཇིག་པ་ལྟ་བུར་ནི། །སེམས་ཀྱི་འཁྲི་ཤིང་དེ་ལྟར་ཤེས་པར་བྱ། །
en: “Although phenomena are neither existent nor nonexistent, They arise based on causes. Thus, they are like lightning that vanishes in the sky as soon as it appears; One should understand that the thicket of the mind is also like that.

source: རླུང་ནི་ནམ་མཁར་མི་ཆགས་རྒྱུ་བ་བཞིན། །གཟུགས་མེད་སེམས་ནི་འདུས་བྱས་དག་ལ་རྒྱུ། །
en: “The formless mind moves among conditioned things Just as wind circulates through space without being caught on anything.

source: སེམས་ཀྱི་རང་བཞིན་རྣམ་དག་དེ་ཤེས་ནས། །ཉོན་མོངས་གཟུགས་མེད་སོགས་པར་མི་འགྱུར་རོ། །
en: Those who understand the pure nature of the mind Will not develop formless afflictions.

source: !ལུས་ནི་རྩིག་པ་རྩྭ་དང་ལོ་མ་འདྲ། །བླུན་པ་རྗེ་མེད་རྡོ་ཤིང་ངན་པ་ལྟར། །དེ་ཡིས་སྔ་མའི་རང་བཞིན་འདྲར་ཤེས་ནས། །ལུས་ཀྱི་ཆོས་ལ་གནས་པར་མི་བྱེད་དོ། །
en: “The body is made of inanimate matter and has no master, Like walls, grass, leaves, stones, or wood. Those who understand its nature in this way Will not dwell on the qualities of the body.

source: ཚིག་ནི་རྟག་ཏུ་གཟུང་མེད་རླུང་དང་འདྲ། །རི་དང་ཕུག་གི་བྲག་ཅ་ལྟ་བུ་སྟེ། །དེ་འདྲར་སྒྲ་ནི་རབ་ཏུ་དབེན་ཤེས་པ། །སྒྲ་རྣམས་ཀུན་ལ་འདོད་པའི་ཆགས་པ་མེད། །
en: “Like the wind, words can never be apprehended. Sounds are void, Like echoes resounding in mountains or caves; Those who understand this will not be attached to any sounds.

source: བདག་ནི་ནམ་མཁའི་ངོས་གནས་མི་ལྟུང་སྟེ། །
en: “I remain here in the sky without falling—

source: མཁའ་ལས་ལྟུང་བའི་གནས་ཀྱང་ཡོད་མ་ཡིན། །
en: It is not possible to fall out of space.

source: ཆོས་འདི་ནམ་མཁའ་འདྲ་བར་བསྒོམས་ནས་ནི། །དེ་ལྟར་སེམས་ཅན་སེམས་ཅན་མེད་མཚུངས་གནས། །
en: Those who meditate on the space-like nature of phenomena Realize that beings share the same mode in being nonexistent.

source: བསྐལ་པ་བརྒྱ་ཕྲག་མང་པོར་བསྲེགས་ཀྱང་ནི། །ཇི་ལྟར་ནམ་མཁའ་ནམ་ཡང་སྔོན་མ་ཚིག །
en: “Even though burned for many hundreds of eons, Space could never be consumed by fire;

source: ཆོས་རྣམས་ཐམས་ཅད་ནམ་མཁར་འདྲར་ཤེས་པ། །དེ་སྲེག་བསྐལ་ཚེ་ཞིང་རྣམས་བརྒྱར་ཡང་འགྲོ། །
en: Those who understand that all phenomena are like space Will travel to hundreds of buddha realms during eons of fire.

source: རི་དང་རི་བར་ཁོ་ར་ཁོར་ཡུག་རི། །དེ་བཞིན་རི་དང་བཅས་པའི་ས་རྣམས་ཀུན། །ནམ་མཁའི་ངོས་ཀྱིས་ཕྱེ་བར་རིག་ནས་དེ། །རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་བྱེ་བའི་ཞིང་དུ་འགྲོ། །
en: “Those who know the space-like characteristic Of all mountains, such as Mount Sumeru, the surrounding mountains, And all the mountainous regions, Will miraculously travel to millions of buddha realms.

source: ས་དང་ཆུ་དང་མེ་དང་རླུང་དག་དང་། །ཁམས་བཞི་འདི་དག་ནམ་མཁའི་ངོས་མཉམ་པར། །དཔའ་བོ་ཚུལ་འདི་ཁོང་དུ་ཆུད་པ་དག །མཁའ་ལས་བྱེ་བ་མཐའ་ཡས་ཞིང་དུ་འགྲོ། །
en: “The heroes who comprehend that the four elements — Earth, water, fire, and wind— Are just like open space Will travel through the sky to countless millions of realms.

source: སྲིད་པ་གསུམ་ན་སྒྲ་དང་སྐད་ཀྱི་བག །བཟང་ངན་དེ་བཞིན་འབྲིང་པོ་ཅི་ཡོད་པ། །དེ་ཡི་མཐའ་མ་བསྐལ་པ་བརྒྱར་བརྗོད་ཀྱང་། །སྔོན་གྱི་རང་བཞིན་མི་སྣང་རྒྱུ་བ་མེད། །
en: “Even if one tried to describe their full scope for a hundred eons, Using all the words and languages found in the three realms— Anything fine, crude, and in-between— It would not appear as the nature of what has been before; it is beyond movement.

source: རང་བྱུང་བ་ནི་མཚན་མཆོག་མ་ཡིན་ཡང་། །
en: “Although being self-arisen is not the supreme mark,

source: སེམས་ཀྱི་ཆོས་ཀྱིས་གཟུགས་ཀྱིས་རབ་ཏུ་ཕྱེ། །
en: It is distinguished in its nature by being a mental phenomenon.

source: སེམས་དང་ཡིད་ནི་མཚུངས་པ་དབེན་པར་གྱུར། །རྒྱལ་བ་ཐམས་ཅད་ཆོས་མཚུངས་ཉིད་ཕྱིར་མཉམ། །
en: Because thoughts and the mind are the same in being void, And because all victors are equal in qualities, they are the same.

source: སྔོན་གྱི་སྲིད་པར་བྱང་ཆུབ་སྤྱད་སྤྱོད་ཅིང་། །དགེ་བ་བརྒྱ་སྟོང་རབ་ཏུ་བསགས་ནས་ནི། །བྱང་ཆུབ་མཉམ་ཞིང་མཉམ་པར་རབ་ཤེས་པ། །གྲགས་པ་ཆེན་པོ་རྣམས་ནི་ལུང་བསྟན་འགྱུར། །
en: “The illustrious ones who understand the sameness of awakening After having practiced bodhisattva conduct in their past lives And gathered hundreds of thousands of virtues Will receive a prophecy.

source: ཆོས་རྣམས་ཀུན་ནི་རང་ཡུལ་ཡང་དག་སྟེ། །
en: “All phenomena are pristine in their own domain;

source: མཐའ་ཡས་ཕྱིར་ནི་རྒྱལ་བའི་ཡུལ་དུ་མཉམ། །
en: Being infinite, they are the same as the domain of the victors.

source: མཉམ་ཉིད་འདི་དག་གང་གིས་རབ་ཤེས་པ། །ཡོན་ཏན་ལྡན་པ་དེ་དག་ལུང་བསྟན་འགྱུར། །
en: Beings with excellent qualities who understand this sameness Will receive a prophecy.

source: བདག་ནི་གཟུགས་མིན་ཚོར་མིན་འདུ་ཤེས་མིན། །སེམས་པ་མ་ཡིན་རྣམ་པར་ཤེས་མེད་ཀྱང་། །
en: “Although I am beyond form, feeling, perception, Formation, and consciousness,

source: བྱང་ཆུབ་ཁོང་དུ་ཆུད་པས་བདག་ལུང་བསྟན། །
en: I received a prophecy because I understand awakening—

source: ཕུང་པོ་ཁམས་ཀྱིས་བདག་ནི་ལུང་མ་བསྟན། །
en: I did not receive it because of my aggregates and elements.

source: བཟོད་པ་གང་ཞིག་གཟོད་མ་ནས་ཞི་ཡི། །སྐད་ཅིག་པ་ནི་ཟད་དང་འདྲ་མིན་ལ། །
en: “Acceptance is primordially peaceful— It is not momentary and finite.

source: མཚུངས་མེད་མི་སྐྱེ་བ་ལ་བཟོད་པ་ན། །མི་དབང་འགྱུར་ཞེས་རྒྱལ་བས་ལུང་བསྟན་ཏོ། །
en: The Victor predicted that those who attain the peerless acceptance of the unborn Will become rulers of men.

source: ཆོས་རྣམས་ཀུན་དང་བདག་ཏུ་རང་བཞིན་མཉམ། །
en: “The nature of all phenomena and the self are the same—

source: བདག་ནི་བདག་མེད་སྟོང་པའི་རང་བཞིན་ཏེ། །
en: The self is selfless and intrinsically empty.

source: སྟོང་པ་ནམ་མཁའ་འདྲ་བའི་ངོ་བོ་ཉིད། །བྱང་ཆུབ་རྟག་ཏུ་མཁའ་མཉམ་རང་བཞིན་ནོ། །
en: Emptiness has the essential nature of space, And awakening always has the nature of space.

source: ཟད་པར་བྱ་ཕྱིར་ཟད་པ་ཤེས་མི་ནུས། །
en: “Since it is yet to be exhausted, exhaustion cannot be known;

source: མི་ཟད་པ་ནི་ཟད་པས་ཟད་མི་འགྱུར། །
en: Since the inexhaustible is exhausted, it will not be exhausted.

source: ཟད་པའི་སྒོ་ཡིས་ཆོས་རྣམས་ཀུན་མ་སྐྱེས། །
en: Through the gateway of exhaustion, all phenomena are unborn;

source: བཟོད་དང་ལྡན་ལ་སངས་རྒྱས་ལུང་སྟོན་ཏོ། །
en: Thus the Buddha predicted those endowed with acceptance.”

source: མཚན་མེད་གནས་འཇུག་པ་ཡི་གནས་མེད་དེ། །
en: “Being signless, there is no foundation for foundational engagements.

source: ཡང་དག་འདུས་མ་བྱས་པ་དུས་ལས་གྲོལ། །
en: Ultimately, what is unconditioned is free from time.

source: མ་བྱས་བྱེད་དུ་མ་བཅུག་བྱུང་བ་མིན། །
en: It is uncreated, impervious to activity, and nonarisen;

source: དེ་བཞིན་ཉིད་འདྲར་རྒྱལ་བས་བདག་ལུང་བསྟན། །
en: The Victor prophesies in such a way.

source: གལ་ཏེ་བདག་ནི་ལུང་བསྟན་འགྱུར་སྙམ་ན། །
en: “If I thought, ‘I will be prophesied,’

source: ཆོས་ལམ་ཚུལ་ལ་མི་མཉམ་སྦྱོར་བ་ཡིན། །
en: I would connect with the Dharma path in an uneven manner.

source: སེམས་དང་ཡིད་ཀྱིས་སྦྱོར་བ་སྦྱོར་མ་ཡིན། །
en: Not connecting with the Dharma by means of thinking and mind

source: ཆོས་སྦྱོར་ཁྱད་པར་འཕགས་འདི་མཚུངས་ཤིང་མཉམ། །
en: Is the exalted way of connecting with the Dharma—the way of sameness and equality.

source: ཁྱེད་ཅག་ཐམས་ཅད་ས་ཡི་སྟེང་ན་འཁོད། །
en: “You are all sitting on the ground, While

source: བདག་ནི་ནམ་མཁའི་དཀྱིལ་ན་རྣམ་པར་གནས། །
en: I remain here in the middle of the sky.

source: ས་དང་ནམ་མཁའ་མཉམ་པར་ཤེས་ནས་ནི། །སྲིད་པ་གསུམ་ན་ཆགས་མེད་ཡེ་ཤེས་འཇུག །
en: Understand that the earth and the sky are the same, Give up attachment to the three realms, and develop wisdom!”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་ནས་སྟེང་གི་བར་སྣང་ལས་བབས་ཏེ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After he had uttered those verses, the kiṃnara king Druma descended from the sky, joined his palms together, prostrated to the Blessed One, and said,

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ནི་བདག་གི་ཆེད་དུ་བྱུང་ངོ་། །
en: “Blessed One, the Buddha has appeared for my sake.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why did he do so?

source: བཅོམ་ལྡན་འདས་བདག་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དོན་མ་མཆིས་པར་མ་བགྱིས་ཏེ།
en: Because I have never engaged in bodhisattva conduct meaninglessly in the past, and

source: སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱིས་བདག་མ་བསླུས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་བསྐང་བའི་སླད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །
en: since I have not broken faith with my previous roots of merit, the Blessed One has prophesied my unsurpassed and perfect awakening to fulfill all my aspirations.”

source: དེ་ནས་འཁོར་དེའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་འདི་ལྟ་བུའི་སེམས་བསྐྱེད་དེ། མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ལས་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ་སྙམ་མོ། །
en: At that moment, some bodhisattvas present in the assembly wondered, “Under which thus-gone one, worthy one, perfect buddha did the kiṃnara king Druma first give rise to the mind set on unsurpassed and perfect awakening?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Knowing the thought that had arisen in the minds of those bodhisattvas, the bodhisattva Divyamauli asked the Blessed One,

source: བཅོམ་ལྡན་འདས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་དེ་བཞིན་གཤེགས་པ་གང་ལས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཅི་ལགས།
en: “Blessed One, what is the name of the thus-gone one under whom the kiṃnara king Druma first gave rise to the mind set on awakening?”

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ། རྒྱས་པ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་བསྐལ་པ་ལ་འཇིག་རྟེན་གྱི་ཁམས་དགེ་བ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་ཆེན་ཕུང་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Noble son,” “In the past, countless eons ago, so long ago that the amount of time cannot be measured or conceived, during the eon called Viprasanna, a thus-gone one, a worthy one, a perfect buddha appeared in the world, in the universe called Śubhā. He was learned and virtuous, a blissful one, a knower of the world, a charioteer who guides beings, an unsurpassed being, a teacher of gods and humans, and a blessed buddha known as Ratnaskandha.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་ཕུང་པོ་དེའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་བྱེ་བ་ཕྲག་དྲུག་ཅུར་གྱུར་ཏེ
en: Noble son, at that time, the saṅgha of bodhisattvas of the Thus-Gone One, the worthy one, the perfect Buddha Ratnaskandha counted six hundred million members.
